In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [4]:
df.shape

(891, 12)

In [5]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [7]:
non_categorical_ = df.loc[:,df.dtypes != object]

In [8]:
non_categorical_

     PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0              1         0       3  22.0      1      0   7.2500
1              2         1       1  38.0      1      0  71.2833
2              3         1       3  26.0      0      0   7.9250
3              4         1       1  35.0      1      0  53.1000
4              5         0       3  35.0      0      0   8.0500
..           ...       ...     ...   ...    ...    ...      ...
886          887         0       2  27.0      0      0  13.0000
887          888         1       1  19.0      0      0  30.0000
888          889         0       3   NaN      1      2  23.4500
889          890         1       1  26.0      0      0  30.0000
890          891         0       3  32.0      0      0   7.7500

[891 rows x 7 columns]

In [9]:
categorical_ = df.loc[:,df.dtypes == object]

In [10]:
categorical_

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

# Split dataset using Loop

In [11]:
def split_dataset_(df):
    non_categorical_ = df.loc[:,df.dtypes != object]
    categorical_ = df.loc[:,df.dtypes == object]
    return non_categorical_,categorical_

In [12]:
split_dataset = split_dataset_(df)

In [13]:
non_categorical_ = split_dataset[0]
categorical_     = split_dataset[1]

In [14]:
#print the categorical data
categorical_

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [15]:
#print the non_categorical data
non_categorical_

     PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0              1         0       3  22.0      1      0   7.2500
1              2         1       1  38.0      1      0  71.2833
2              3         1       3  26.0      0      0   7.9250
3              4         1       1  35.0      1      0  53.1000
4              5         0       3  35.0      0      0   8.0500
..           ...       ...     ...   ...    ...    ...      ...
886          887         0       2  27.0      0      0  13.0000
887          888         1       1  19.0      0      0  30.0000
888          889         0       3   NaN      1      2  23.4500
889          890         1       1  26.0      0      0  30.0000
890          891         0       3  32.0      0      0   7.7500

[891 rows x 7 columns]

In [16]:
categorical_.loc[:,categorical_.isnull().sum()>0].columns

Index(['Cabin', 'Embarked'], dtype='object')

In [17]:
def categorical_features(df):
    index_ = df.loc[:,df.isnull().sum()>0].columns
    return index_

In [18]:
categorical_features = categorical_features(categorical_)

In [19]:
for features in categorical_features:
    print("feature ",features,' has missing values = ',categorical_[features].isnull().sum().sum())

feature  Cabin  has missing values =  687
feature  Embarked  has missing values =  2

# Using most Frequent

In [20]:
categorical_['Cabin'].isnull().sum()

687

In [21]:
categorical_['Cabin'].value_counts().sort_values(ascending = False).index[0]

'B96 B98'

In [22]:
def impute_nan(df, features):
    most_frequent_value_ = df[features].value_counts().sort_values(ascending = False).index[0]
    df[features].fillna(most_frequent_value_,inplace = True)

In [23]:
def categorical_features(df):
    index_ = df.loc[:,df.isnull().sum()>0].columns
    return index_

def non_categorical_features(df):
    index_ = df.loc[:,df.isnull().sum()>0].columns
    return index_

In [24]:
def non_categorical_features(df):
    index_ = df.loc[:,df.isnull().sum()>0].columns
    return index_

In [25]:
non_categorical_features = non_categorical_features(non_categorical_)
categorical_features     = categorical_features(categorical_)

In [26]:
non_categorical_features

Index(['Age'], dtype='object')

In [27]:
for features in non_categorical_features:
    impute_nan(non_categorical_,features)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:4463: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().fillna(

In [28]:
for features in categorical_features:
    impute_nan(categorical_,features)

In [29]:
categorical_.isnull().sum()

Name        0
Sex         0
Ticket      0
Cabin       0
Embarked    0
dtype: int64

In [30]:
df = pd.concat([categorical_,non_categorical_],axis = 1)
df.head(3)

,Name,Sex,Ticket,Cabin,Embarked,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
0,"Braund, Mr. Owen Harris",male,A/5 21171,B96 B98,S,1,0,3,22.0,1,0,7.2500
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C,2,1,1,38.0,1,0,71.2833
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,B96 B98,S,3,1,3,26.0,0,0,7.9250

In [31]:
df.shape

(891, 12)

In [32]:
df.isnull().sum().sum()

0

In [33]:
Fare_ = df['Fare']

In [34]:
df['Fare'] = df['Survived']

In [35]:
df['Survived'] = Fare_

In [36]:
df.head(4)

,Name,Sex,Ticket,Cabin,Embarked,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
0,"Braund, Mr. Owen Harris",male,A/5 21171,B96 B98,S,1,7.2500,3,22.0,1,0,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C,2,71.2833,1,38.0,1,0,1
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,B96 B98,S,3,7.9250,3,26.0,0,0,1
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S,4,53.1000,1,35.0,1,0,1

In [37]:
df = pd.get_dummies(df, drop_first=True)

In [38]:
df.shape

(891, 1726)

In [39]:
X = df.iloc[:,:-1].values
y = df.loc[:,'Fare'].values

In [40]:
X

array([[  1.    ,   7.25  ,   3.    , ...,   0.    ,   0.    ,   0.    ],
       [  2.    ,  71.2833,   1.    , ...,   0.    ,   0.    ,   0.    ],
       [  3.    ,   7.925 ,   3.    , ...,   0.    ,   0.    ,   0.    ],
       ...,
       [889.    ,  23.45  ,   3.    , ...,   0.    ,   0.    ,   0.    ],
       [890.    ,  30.    ,   1.    , ...,   0.    ,   0.    ,   0.    ],
       [891.    ,   7.75  ,   3.    , ...,   0.    ,   0.    ,   1.    ]])

In [41]:
from sklearn.model_selection import train_test_split

In [42]:
x_train, x_test,y_train, y_test = train_test_split(X,y,test_size=.30, random_state=0)

In [43]:
from sklearn.tree import DecisionTreeClassifier

In [44]:
dt = DecisionTreeClassifier()
dt.fit(x_train,y_train)
dt.score(x_test,y_test)

1.0

In [45]:
from sklearn.linear_model import LogisticRegression

In [46]:
lr = LogisticRegression()
lr.fit(x_train,y_train)
lr.score(x_test,y_test)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:763: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

1.0

In [47]:
df = pd.read_csv('adult.csv',na_values=['?','??','???'])
df.shape

(48842, 15)

In [48]:
df.head(4)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K

In [49]:
df.isnull().sum()

age                   0
workclass          2799
fnlwgt                0
education             0
educational-num       0
marital-status        0
occupation         2809
relationship          0
race                  0
gender                0
capital-gain          0
capital-loss          0
hours-per-week        0
native-country      857
income                0
dtype: int64

In [50]:
df.dtypes

age                 int64
workclass          object
fnlwgt              int64
education          object
educational-num     int64
marital-status     object
occupation         object
relationship       object
race               object
gender             object
capital-gain        int64
capital-loss        int64
hours-per-week      int64
native-country     object
income             object
dtype: object

In [51]:
def split_dataset_(df):
    non_categorical_ = df.loc[:,df.dtypes != object]
    categorical_ = df.loc[:,df.dtypes == object]
    return non_categorical_,categorical_

In [52]:
split_dataset = split_dataset_(df)

In [53]:
non_categorical_ = split_dataset[0]
categorical_     = split_dataset[1]

In [54]:
non_categorical_

,age,fnlwgt,educational-num,capital-gain,capital-loss,hours-per-week
0,25,226802,7,0,0,40
1,38,89814,9,0,0,50
2,28,336951,12,0,0,40
3,44,160323,10,7688,0,40
4,18,103497,10,0,0,30
...,...,...,...,...,...,...
48837,27,257302,12,0,0,38
48838,40,154374,9,0,0,40
48839,58,151910,9,0,0,40
48840,22,201490,9,0,0,20
48841,52,287927,9,15024,0,40

In [55]:
non_categorical_.isnull().sum()

age                0
fnlwgt             0
educational-num    0
capital-gain       0
capital-loss       0
hours-per-week     0
dtype: int64

In [56]:
categorical_.isnull().sum()

workclass         2799
education            0
marital-status       0
occupation        2809
relationship         0
race                 0
gender               0
native-country     857
income               0
dtype: int64

In [57]:
def categorical_features(df):
    index_ = df.loc[:,df.isnull().sum()>0].columns
    return index_

In [58]:
def impute_nan(df, features):
    most_frequent_value_ = df[features].value_counts().sort_values(ascending = False).index[0]
    df[features].fillna(most_frequent_value_,inplace = True)

In [59]:
def categorical_features(df):
    index_ = df.loc[:,df.isnull().sum()>0].columns
    return index_

def non_categorical_features(df):
    index_ = df.loc[:,df.isnull().sum()>0].columns
    return index_

In [60]:
non_categorical_features = non_categorical_features(non_categorical_)
categorical_features     = categorical_features(categorical_)

In [61]:
for features in non_categorical_features:
    impute_nan(non_categorical_,features)

In [62]:
for features in categorical_features:
    impute_nan(categorical_,features)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:4463: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().fillna(

In [63]:
categorical_features.isnull().sum()

0

In [64]:
df = pd.concat([categorical_,non_categorical_],axis = 1)
df.head(3)

,workclass,education,marital-status,occupation,relationship,race,gender,native-country,income,age,fnlwgt,educational-num,capital-gain,capital-loss,hours-per-week
0,Private,11th,Never-married,Machine-op-inspct,Own-child,Black,Male,United-States,<=50K,25,226802,7,0,0,40
1,Private,HS-grad,Married-civ-spouse,Farming-fishing,Husband,White,Male,United-States,<=50K,38,89814,9,0,0,50
2,Local-gov,Assoc-acdm,Married-civ-spouse,Protective-serv,Husband,White,Male,United-States,>50K,28,336951,12,0,0,40

In [65]:
df.shape

(48842, 15)

In [66]:
df = pd.get_dummies(df, drop_first=True)

In [67]:
df.columns

Index(['age', 'fnlwgt', 'educational-num', 'capital-gain', 'capital-loss',
       'hours-per-week', 'workclass_Local-gov', 'workclass_Never-worked',
       'workclass_Private', 'workclass_Self-emp-inc',
       'workclass_Self-emp-not-inc', 'workclass_State-gov',
       'workclass_Without-pay', 'education_11th', 'education_12th',
       'education_1st-4th', 'education_5th-6th', 'education_7th-8th',
       'education_9th', 'education_Assoc-acdm', 'education_Assoc-voc',
       'education_Bachelors', 'education_Doctorate', 'education_HS-grad',
       'education_Masters', 'education_Preschool', 'education_Prof-school',
       'education_Some-college', 'marital-status_Married-AF-spouse',
       'marital-status_Married-civ-spouse',
       'marital-status_Married-spouse-absent', 'marital-status_Never-married',
       'marital-status_Separated', 'marital-status_Widowed',
       'occupation_Armed-Forces', 'occupation_Craft-repair',
       'occupation_Exec-managerial', 'occupation_Farming-fishing',
       'occupation_Handlers-cleaners', 'occupation_Machine-op-inspct',
       'occupation_Other-service', 'occupation_Priv-house-serv',
       'occupation_Prof-specialty', 'occupation_Protective-serv',
       'occupation_Sales', 'occupation_Tech-support',
       'occupation_Transport-moving', 'relationship_Not-in-family',
       'relationship_Other-relative', 'relationship_Own-child',
       'relationship_Unmarried', 'relationship_Wife',
       'race_Asian-Pac-Islander', 'race_Black', 'race_Other', 'race_White',
       'gender_Male', 'native-country_Canada', 'native-country_China',
       'native-country_Columbia', 'native-country_Cuba',
       'native-country_Dominican-Republic', 'native-country_Ecuador',
       'native-country_El-Salvador', 'native-country_England',
       'native-country_France', 'native-country_Germany',
       'native-country_Greece', 'native-country_Guatemala',
       'native-country_Haiti', 'native-country_Holand-Netherlands',
       'native-country_Honduras', 'native-country_Hong',
       'native-country_Hungary', 'native-country_India', 'native-country_Iran',
       'native-country_Ireland', 'native-country_Italy',
       'native-country_Jamaica', 'native-country_Japan', 'native-country_Laos',
       'native-country_Mexico', 'native-country_Nicaragua',
       'native-country_Outlying-US(Guam-USVI-etc)', 'native-country_Peru',
       'native-country_Philippines', 'native-country_Poland',
       'native-country_Portugal', 'native-country_Puerto-Rico',
       'native-country_Scotland', 'native-country_South',
       'native-country_Taiwan', 'native-country_Thailand',
       'native-country_Trinadad&Tobago', 'native-country_United-States',
       'native-country_Vietnam', 'native-country_Yugoslavia', 'income_>50K'],
      dtype='object')

In [68]:
df['income_>50K']

0        0
1        0
2        1
3        1
4        0
        ..
48837    0
48838    1
48839    0
48840    0
48841    1
Name: income_>50K, Length: 48842, dtype: uint8

In [69]:
X = df.iloc[:,:-1]
y = df.loc[:,'income_>50K']

In [70]:
x_train, x_test,y_train, y_test = train_test_split(X,y,test_size=.30, random_state = 0)

In [71]:
dt = DecisionTreeClassifier()
dt.fit(x_train,y_train)
dt.score(x_test,y_test)

0.818194226438272

In [72]:
lr = LogisticRegression()
lr.fit(x_train,y_train)
lr.score(x_test,y_test)

0.7983348119838941

In [73]:
from sklearn.ensemble import AdaBoostClassifier

In [74]:
adc = AdaBoostClassifier(n_estimators=900)
adc.fit(x_train,y_train)

AdaBoostClassifier(n_estimators=900)

In [75]:
predcition = adc.predict(x_test)

In [76]:
len(predcition)

14653

In [77]:
len(predcition == y_test)/len(y_test)

1.0

In [78]:
adc.score(x_test,y_test)*100

87.32682727086603

In [79]:
from sklearn.ensemble import RandomForestClassifier

In [80]:
rf = RandomForestClassifier(n_estimators=900)

In [81]:
rf.fit(x_train,y_train)

RandomForestClassifier(n_estimators=900)

In [82]:
rf.score(x_test,y_test)

0.8531358766122978

In [83]:
import pandas as pd

In [84]:
df = pd.read_csv('titanic.csv')

In [85]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [86]:
df.shape

(891, 12)

In [87]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [88]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [89]:
df = df.loc[:,df.dtypes != object]

In [90]:
df.head(5)

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

In [91]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Age            177
SibSp            0
Parch            0
Fare             0
dtype: int64

In [92]:
missing_value_ = df.loc[:,df.isnull().sum()>0].columns

In [93]:
print("missing value columns are: ",missing_value_)

missing value columns are:  Index(['Age'], dtype='object')

In [94]:
df[missing_value_].isnull().sum().sum()

177

In [95]:
print("total missing value is = ",df[missing_value_].isnull().sum().sum())

total missing value is =  177

In [96]:
df[missing_value_]

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [97]:
df[missing_value_].dropna().sample(177, random_state = 0)

       Age
423  28.00
177  50.00
305   0.92
292  36.00
889  26.00
..     ...
539  22.00
267  25.00
352  15.00
99   34.00
689  15.00

[177 rows x 1 columns]

In [98]:
df

     PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0              1         0       3  22.0      1      0   7.2500
1              2         1       1  38.0      1      0  71.2833
2              3         1       3  26.0      0      0   7.9250
3              4         1       1  35.0      1      0  53.1000
4              5         0       3  35.0      0      0   8.0500
..           ...       ...     ...   ...    ...    ...      ...
886          887         0       2  27.0      0      0  13.0000
887          888         1       1  19.0      0      0  30.0000
888          889         0       3   NaN      1      2  23.4500
889          890         1       1  26.0      0      0  30.0000
890          891         0       3  32.0      0      0   7.7500

[891 rows x 7 columns]

In [99]:
random_samples = df[missing_value_].dropna().sample(177, random_state = 0)

In [100]:
random_samples.index = df[df['Age'].isnull()].index

In [101]:
df[df[missing_value_].isnull()] = random_samples

In [102]:
df[missing_value_].isnull().sum()

Age    0
dtype: int64

In [103]:
Fare_ = df['Fare']
df['Fare'] = df['Survived']
df['Survived'] = Fare_

In [104]:
df

     PassengerId  Survived  Pclass   Age  SibSp  Parch  Fare
0              1    7.2500       3  22.0      1      0     0
1              2   71.2833       1  38.0      1      0     1
2              3    7.9250       3  26.0      0      0     1
3              4   53.1000       1  35.0      1      0     1
4              5    8.0500       3  35.0      0      0     0
..           ...       ...     ...   ...    ...    ...   ...
886          887   13.0000       2  27.0      0      0     0
887          888   30.0000       1  19.0      0      0     1
888          889   23.4500       3  15.0      1      2     0
889          890   30.0000       1  26.0      0      0     1
890          891    7.7500       3  32.0      0      0     0

[891 rows x 7 columns]

In [105]:
X = df.iloc[:,:-1].values
y = df.iloc[:,-1].values

In [106]:
x_train, x_test, y_train, y_test = train_test_split(X,y, test_size=0.30)

In [107]:
from sklearn.ensemble import AdaBoostClassifier

In [108]:
rf = AdaBoostClassifier(n_estimators=100)

In [109]:
rf.fit(x_train,y_train)
rf.score(x_test,y_test)

0.667910447761194

In [159]:
df = pd.read_csv('titanic.csv')

In [160]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [161]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [162]:
df = df.loc[:,df.dtypes != object]

In [163]:
df.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

In [164]:
df

     PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0              1         0       3  22.0      1      0   7.2500
1              2         1       1  38.0      1      0  71.2833
2              3         1       3  26.0      0      0   7.9250
3              4         1       1  35.0      1      0  53.1000
4              5         0       3  35.0      0      0   8.0500
..           ...       ...     ...   ...    ...    ...      ...
886          887         0       2  27.0      0      0  13.0000
887          888         1       1  19.0      0      0  30.0000
888          889         0       3   NaN      1      2  23.4500
889          890         1       1  26.0      0      0  30.0000
890          891         0       3  32.0      0      0   7.7500

[891 rows x 7 columns]

In [165]:
df.drop('PassengerId', axis = 1, inplace= True)

In [166]:
df.head(3)

   Survived  Pclass   Age  SibSp  Parch     Fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250

In [167]:
df.columns

Index(['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [168]:
X = df.iloc[:,1:].values
y = df.loc[:, 'Survived'].values

In [169]:
x_train, x_test, y_train, y_test = train_test_split(X,y, test_size=0.30,random_state=0)

In [170]:
from sklearn.impute import KNNImputer

In [171]:
imputer_ = KNNImputer(n_neighbors = 3, weights= 'uniform')
x_train = imputer_.fit_transform(x_train)
x_test  = imputer_.transform(x_test)

In [172]:
pd.DataFrame(x_train)

       0          1    2    3        4
0    1.0  51.000000  0.0  0.0  26.5500
1    1.0  49.000000  1.0  0.0  76.7292
2    3.0   1.000000  5.0  2.0  46.9000
3    1.0  54.000000  0.0  1.0  77.2875
4    3.0  18.500000  1.0  0.0  14.4583
..   ...        ...  ...  ...      ...
618  1.0  39.000000  1.0  1.0  83.1583
619  3.0  19.000000  1.0  0.0   7.8542
620  3.0  30.333333  0.0  0.0   7.7333
621  3.0  36.000000  1.0  0.0  17.4000
622  2.0  60.000000  1.0  1.0  39.0000

[623 rows x 5 columns]

In [173]:
ad = AdaBoostClassifier(n_estimators=100)

In [174]:
rf.fit(x_train,y_train)
rf.score(x_test,y_test)

0.7164179104477612

In [175]:
from sklearn.impute import SimpleImputer

In [176]:
simple_imputer_ = SimpleImputer(strategy='median')
x_train = simple_imputer_.fit_transform(x_train)
x_test  = simple_imputer_.transform(x_test)
rf.fit(x_train,y_train)
rf.score(x_test,y_test)

0.7164179104477612